#+title: Guido's Emacs Config
#+startup: overview
** Directory
If you use `org' and don't want your org files in the default location below,
change `org-directory'. It must be set before org loads!
#+begin_src emacs-lisp :tangle yes
(setq org-directory "~/org")

(setq org-roam-directory "~/org/roam")
#+end_src

#+RESULTS:
: ~/org/roam

*** org-agenda
 #+begin_src emacs-lisp :tangle yes
(setq org-agenda-files '("~/org" ;; All ~/org files
                        "~/org/roam/daily" ;; All daily files
      ))
 #+end_src

 #+RESULTS:
 | ~/org | ~/org/roam/daily |

 Capture templates (still not ready to use)
 #+begin_src emacs-lisp :tangle no
(setq org-roam-capture-templates
'(("d" "default" plain "%?"
  :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)
 ;;("p" "Personal templates")
 ("m" "Meetings" plain "%?"
  :target (file+head "meeting/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
  :unnarrowed t)
 ))
 #+end_src

